case/cht_0/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       291616;
    }
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       292016;
    }
    outerwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          15216;
        startFace       292416;
    }
    fluid_to_wall-contact_region-src
    {
        type            patch;
        nFaces          10720;
        startFace       307632;
    }
    contact_region-trg
    {
        type            patch;
        nFaces          10720;
        startFace       318352;
    }
)

// ************************************************************************* //
