case/cht_0/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/solid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    outerwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          15216;
        startFace       136576;
    }
    solid_to_fluid
    {
        type            mappedWall;
		inGroups		List<word> 1(wall);
        nFaces          10720;
        startFace       151792;
		sampleMode		nearestPatchFace;
		sampleRegion	fluid;
		samplePatch     fluid_to_solid;
    }
)

// ************************************************************************* //
